SSLD/3-3 3.17 Expression - Ideas 1 - Matching N3C.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-12-04 Wed 16:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="DESKTOP-13B7HQM" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-org395ce18" class="outline-2">
<h2 id="org395ce18">3-3 3.17 Expression - Ideas 1 - Matching N3C</h2>
<div class="outline-text-2" id="text-org395ce18">
<p class="verse">
It sounds, like you said,<br />
&#xa0;the purpose of what you're saying and the audience of who you're saying it to<br />
&#xa0;&#xa0;is really important with facts.<br />
Now I imagine with ideas, it's even more complex than that.<br />
<br />
When we're talking about the expression of ideas,<br />
&#xa0;we want to express in a way that's effective<br />
&#xa0;&#xa0;and what is effective actually depends on what is the purpose of the communication.<br />
If I'm trying to convince you of something or I want you to do something,<br />
&#xa0;that's different ways to really communicating an idea.<br />
For instance, if we have an idea of going to do something together.<br />
I was thinking of going on a canoe trip<br />
&#xa0;&#xa0;and you were thinking of going to a shopping mall<br />
&#xa0;or the other way around, or I want to go to a concert and you want to go camping.<br />
These are different ideas, and when we say, I don't think this is a good idea,<br />
&#xa0;what we are essentially saying this is not the way that I wanted, that doesn't address my needs.<br />
When we run into situations like this,<br />
&#xa0;we try to understand what this other person's needs might be and then try to address it<br />
&#xa0;&#xa0;and then come up with something that we also want to do.<br />
So that is the negotiation of two sets of needs and circumstances, characteristics,<br />
&#xa0;and sometimes we have to pay attention to capacity as well.<br />
The N3Cs of two individuals have to match for us to come up with a good idea.<br />
So that is one way to look at it.<br />
</p>
</div>
<div id="outline-container-org541386d" class="outline-3">
<h3 id="org541386d">expression</h3>
<div class="outline-text-3" id="text-org541386d">
<p>
canoe [kəˈnu]: n. a long light boat that is pointed at both ends and which you move along using a ↑paddle独木舟, 轻舟<br />
match [mætʃ]: v. if one thing matches another, or if two things match, they look attractive together because they are a similar colour, pattern etc ⇨ matching匹配<br />
</p>
<hr />
<p>
have an/the idea of doing sth.: 有做某事的想法<br />
the other way around, + &#x2026;: 倒过来, +&#x2026;<br />
address sb's need(s): 满足某人的需要<br />
</p>
</div>
</div>
<div id="outline-container-org144cad7" class="outline-3">
<h3 id="org144cad7">sentence</h3>
<div class="outline-text-3" id="text-org144cad7">
<p>
canoe [kəˈnu]: n. a long light boat that is pointed at both ends and which you move along using a ↑paddle独木舟, 轻舟<br />
</p>
<ul class="org-ul">
<li>My mother complained that my father sat in a canoe and did nothing at all all day.<br /></li>
<li>There is a canoe we can take advantage of to cross the river.<br /></li>
<li>Being disused for many years, the canoe needs mending.<br /></li>
</ul>
<p>
match [mætʃ]: v. if one thing matches another, or if two things match, they look attractive together because they are a similar colour, pattern etc ⇨ matching匹配<br />
</p>
<ul class="org-ul">
<li>If our bluetooths match, we will be able to transfer files between each other.<br /></li>
<li>The remote control used to manipulate micro wave oven can't match our TV.<br /></li>
<li>The princess was betrothed to a lord which was thought to match her in the country.<br /></li>
</ul>
<hr />
<p>
have an idea of doing sth.: 有做某事的想法<br />
</p>
<ul class="org-ul">
<li>Having an idea of going on a vacation at seaside resort, she began to save money and asked her husband for pocket money.<br /></li>
<li>Our cat has an idea of sneaking into our bedroom and lying on the bed.<br /></li>
<li>As long as you have an idea of getting divorced, you will be overwhelmed by it all the time.<br /></li>
</ul>
<p>
the other way around, + &#x2026;: 倒过来, +&#x2026;<br />
</p>
<ul class="org-ul">
<li>The other way around, our enemies lost their hearts because of the lack of sustenance.<br /></li>
<li>The other way around, our rivals can't find a way to the portal.<br /></li>
<li>The other way around, you didn't lost 3 yuan and have saved 7 yuan.<br /></li>
</ul>
<p>
address sb's needs: 满足某人的需要<br />
</p>
<ul class="org-ul">
<li>How to address his wife's needs to go on a vacation at seaside resort drives him mad.<br /></li>
<li>If I address your needs to keep the cat, you promise me that you will learn it by hearts.<br /></li>
<li>His father never fails to be affectionate towards him and address his needs in time.<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgd4aaf3a" class="outline-3">
<h3 id="orgd4aaf3a">sentence2</h3>
<div class="outline-text-3" id="text-orgd4aaf3a">
<p>
canoe [kəˈnu]: n. a long light boat that is pointed at both ends and which you move along using a ↑paddle独木舟, 轻舟<br />
</p>
<ul class="org-ul">
<li>My mother complained that my father sat in a canoe and did nothing at all all day.<br /></li>
<li>There is a canoe we can take advantage of to cross the river.<br /></li>
<li>For being disused for many years, the canoe needs mending.<br /></li>
</ul>
<p>
match [mætʃ]: v. if one thing matches another, or if two things match, they look attractive together because they are a similar colour, pattern etc ⇨ matching匹配<br />
</p>
<ul class="org-ul">
<li>If our Bluetooth match, we will be able to transfer files between each other.<br /></li>
<li>The remote control used to manipulate micro wave oven can't match our TV.<br /></li>
<li>The princess was betrothed to a lord who was thought to match her in the country.<br /></li>
</ul>
<hr />
<p>
have an/the idea of doing sth.: 有做某事的想法<br />
</p>
<ul class="org-ul">
<li>Having an idea of going on a vacation at a seaside resort, she began to save money and asked her husband for pocket money.<br /></li>
<li>Our cat has the idea of sneaking into our bedroom and lying on the bed.<br /></li>
<li>As long as you have an idea of getting divorced, you will be overwhelmed by it all the time.<br /></li>
</ul>
<p>
the other way around, + &#x2026;: 倒过来, +&#x2026;<br />
</p>
<ul class="org-ul">
<li>The other way around, our enemies lost their hearts because of the lack of sustenance.<br /></li>
<li>The other way around, our rivals can't find a way to the portal.<br /></li>
<li>The other way around, you didn't lose 3 yuan and have saved 7 yuan.<br /></li>
</ul>
<p>
address sb's need(s): 满足某人的需要<br />
</p>
<ul class="org-ul">
<li>How to address his wife's need to go on a vacation at a seaside resort drives him mad.<br /></li>
<li>If I address your needs to keep the cat, you promise me that you will learn it by heart.<br /></li>
<li>His father never fails to be affectionate towards him and address his needs in time.<br /></li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
